IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f2838x_cm_dcsm_common_regs.xml
<module id="DCSM_COMMON_REGS" HW_revision="" description="DCSM COMMON Registers">
	<register id="FLSEM" width="32" page="1" offset="0x0" internal="0" description="Flash Wrapper Semaphore Register">
		<bitfield id="SEM" description="Flash Semaphore Bit" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="KEY" description="Semaphore Key" begin="15" end="8" width="8" rwaccess="RW"/>
	</register>
	<register id="SECTSTAT1" width="32" page="1" offset="0x10" internal="0" description="Flash Sectors Status Register 1">
		<bitfield id="STATUS_SECT0" description="Zone Status flash CPU1 BANK Sector 0" begin="1" end="0" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT1" description="Zone Status flash CPU1 BANK sector 1" begin="3" end="2" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT2" description="Zone Status flash CPU1 BANK Sector 2" begin="5" end="4" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT3" description="Zone Status flash CPU1 BANK Sector 3 " begin="7" end="6" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT4" description="Zone Status flash CPU1 BANK Sector 4" begin="9" end="8" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT5" description="Zone Status flash CPU1 BANK Sector 5 " begin="11" end="10" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT6" description="Zone Status flash CPU1 BANK Sector 6 " begin="13" end="12" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT7" description="Zone Status flash CPU1 BANK Sector 7" begin="15" end="14" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT8" description="Zone Status flash CPU1 BANK sector 8" begin="17" end="16" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT9" description="Zone Status flash CPU1 BANK Sector 9" begin="19" end="18" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT10" description="Zone Status flash CPU1 BANK Sector 10" begin="21" end="20" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT11" description="Zone Status flash CPU1 BANK Sector 11" begin="23" end="22" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT12" description="Zone Status flash CPU1 BANK Sector 12" begin="25" end="24" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT13" description="Zone Status flash CPU1 BANK Sector 13" begin="27" end="26" width="2" rwaccess="R"/>
	</register>
	<register id="SECTSTAT2" width="32" page="1" offset="0x14" internal="0" description="Flash Sectors Status Register 2">
		<bitfield id="STATUS_SECT0" description="Zone Status flash CM BANK Sector 0" begin="1" end="0" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT1" description="Zone Status flash CM BANK sector 1" begin="3" end="2" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT2" description="Zone Status flash CM BANK Sector 2" begin="5" end="4" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT3" description="Zone Status flash CM BANK Sector 3 " begin="7" end="6" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT4" description="Zone Status flash CM BANK Sector 4" begin="9" end="8" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT5" description="Zone Status flash CM BANK Sector 5 " begin="11" end="10" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT6" description="Zone Status flash CM BANK Sector 6 " begin="13" end="12" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT7" description="Zone Status flash CM BANK Sector 7" begin="15" end="14" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT8" description="Zone Status flash CM BANK sector 8" begin="17" end="16" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT9" description="Zone Status flash CM BANK Sector 9" begin="19" end="18" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT10" description="Zone Status flash CM BANK Sector 10" begin="21" end="20" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT11" description="Zone Status flash CM BANK Sector 11" begin="23" end="22" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT12" description="Zone Status flash CM BANK Sector 12" begin="25" end="24" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT13" description="Zone Status flash CM BANK Sector 13" begin="27" end="26" width="2" rwaccess="R"/>
	</register>
	<register id="SECTSTAT3" width="32" page="1" offset="0x18" internal="0" description="Flash Sectors Status Register 3">
		<bitfield id="STATUS_SECT0" description="Zone Status flash CPU2 BANK Sector 0" begin="1" end="0" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT1" description="Zone Status flash CPU2 BANK sector 1" begin="3" end="2" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT2" description="Zone Status flash CPU2 BANK Sector 2" begin="5" end="4" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT3" description="Zone Status flash CPU2 BANK Sector 3 " begin="7" end="6" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT4" description="Zone Status flash CPU2 BANK Sector 4" begin="9" end="8" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT5" description="Zone Status flash CPU2 BANK Sector 5 " begin="11" end="10" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT6" description="Zone Status flash CPU2 BANK Sector 6 " begin="13" end="12" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT7" description="Zone Status flash CPU2 BANK Sector 7" begin="15" end="14" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT8" description="Zone Status flash CPU2 BANK sector 8" begin="17" end="16" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT9" description="Zone Status flash CPU2 BANK Sector 9" begin="19" end="18" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT10" description="Zone Status flash CPU2 BANK Sector 10" begin="21" end="20" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT11" description="Zone Status flash CPU2 BANK Sector 11" begin="23" end="22" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT12" description="Zone Status flash CPU2 BANK Sector 12" begin="25" end="24" width="2" rwaccess="R"/>
		<bitfield id="STATUS_SECT13" description="Zone Status flash CPU2 BANK Sector 13" begin="27" end="26" width="2" rwaccess="R"/>
	</register>
	<register id="RAMSTAT1" width="32" page="1" offset="0x20" internal="0" description="RAM Status Register 1">
		<bitfield id="STATUS_RAM0" description="Zone Status RAM CPU1.LS0" begin="1" end="0" width="2" rwaccess="R"/>
		<bitfield id="STATUS_RAM1" description="Zone Status RAM CPU1.LS1" begin="3" end="2" width="2" rwaccess="R"/>
		<bitfield id="STATUS_RAM2" description="Zone Status RAM CPU1.LS2" begin="5" end="4" width="2" rwaccess="R"/>
		<bitfield id="STATUS_RAM3" description="Zone Status RAM CPU1.LS3" begin="7" end="6" width="2" rwaccess="R"/>
		<bitfield id="STATUS_RAM4" description="Zone Status RAM CPU1.LS4" begin="9" end="8" width="2" rwaccess="R"/>
		<bitfield id="STATUS_RAM5" description="Zone Status RAM CPU1.LS5" begin="11" end="10" width="2" rwaccess="R"/>
		<bitfield id="STATUS_RAM6" description="Zone Status RAM CPU1.LS6" begin="13" end="12" width="2" rwaccess="R"/>
		<bitfield id="STATUS_RAM7" description="Zone Status RAM CPU1.LS7" begin="15" end="14" width="2" rwaccess="R"/>
		<bitfield id="STATUS_RAM8" description="Zone Status RAM CPU1.D0" begin="17" end="16" width="2" rwaccess="R"/>
		<bitfield id="STATUS_RAM9" description="Zone Status RAM CPU1.D1" begin="19" end="18" width="2" rwaccess="R"/>
	</register>
	<register id="RAMSTAT2" width="32" page="1" offset="0x24" internal="0" description="RAM Status Register 2">
		<bitfield id="STATUS_RAM0" description="Zone Status RAM CM.C0" begin="1" end="0" width="2" rwaccess="R"/>
		<bitfield id="STATUS_RAM1" description="Zone Status RAM CM.C1" begin="3" end="2" width="2" rwaccess="R"/>
		<bitfield id="STATUS_RAM4" description="Zone Status RAM CPU1 to CM MSG RAM 1" begin="9" end="8" width="2" rwaccess="R"/>
		<bitfield id="STATUS_RAM5" description="Zone Status RAM CPU1 to CM MSG RAM 2" begin="11" end="10" width="2" rwaccess="R"/>
		<bitfield id="STATUS_RAM6" description="Zone Status RAM CM to CPU1 MSG RAM 1" begin="13" end="12" width="2" rwaccess="R"/>
		<bitfield id="STATUS_RAM7" description="Zone Status RAM CM to CPU1 MSG RAM 2" begin="15" end="14" width="2" rwaccess="R"/>
		<bitfield id="STATUS_RAM8" description="Zone Status RAM CPU2 to CM MSG RAM 1" begin="17" end="16" width="2" rwaccess="R"/>
		<bitfield id="STATUS_RAM9" description="Zone Status RAM CPU2 to CM MSG RAM 2" begin="19" end="18" width="2" rwaccess="R"/>
		<bitfield id="STATUS_RAM10" description="Zone Status RAM CM to CPU2 MSG RAM 1" begin="21" end="20" width="2" rwaccess="R"/>
		<bitfield id="STATUS_RAM11" description="Zone Status RAM CM to CPU2 MSG RAM 2" begin="23" end="22" width="2" rwaccess="R"/>
		<bitfield id="STATUS_RAM12" description="Zone Status RAM CPU1 to CPU2 MSG RAM 1" begin="25" end="24" width="2" rwaccess="R"/>
		<bitfield id="STATUS_RAM13" description="Zone Status RAM CPU1 to CPU2 MSG RAM 2" begin="27" end="26" width="2" rwaccess="R"/>
		<bitfield id="STATUS_RAM14" description="Zone Status RAM CPU2 to CPU1 MSG RAM 1" begin="29" end="28" width="2" rwaccess="R"/>
		<bitfield id="STATUS_RAM15" description="Zone Status RAM CPU2 to CPU1 MSG RAM 2" begin="31" end="30" width="2" rwaccess="R"/>
	</register>
	<register id="RAMSTAT3" width="32" page="1" offset="0x28" internal="0" description="RAM Status Register 3">
		<bitfield id="STATUS_RAM0" description="Zone Status RAM CPU2.LS0" begin="1" end="0" width="2" rwaccess="R"/>
		<bitfield id="STATUS_RAM1" description="Zone Status RAM CPU2.LS1" begin="3" end="2" width="2" rwaccess="R"/>
		<bitfield id="STATUS_RAM2" description="Zone Status RAM CPU2.LS2" begin="5" end="4" width="2" rwaccess="R"/>
		<bitfield id="STATUS_RAM3" description="Zone Status RAM CPU2.LS3" begin="7" end="6" width="2" rwaccess="R"/>
		<bitfield id="STATUS_RAM4" description="Zone Status RAM CPU2.LS4" begin="9" end="8" width="2" rwaccess="R"/>
		<bitfield id="STATUS_RAM5" description="Zone Status RAM CPU2.LS5" begin="11" end="10" width="2" rwaccess="R"/>
		<bitfield id="STATUS_RAM6" description="Zone Status RAM CPU2.LS6" begin="13" end="12" width="2" rwaccess="R"/>
		<bitfield id="STATUS_RAM7" description="Zone Status RAM CPU2.LS7" begin="15" end="14" width="2" rwaccess="R"/>
		<bitfield id="STATUS_RAM8" description="Zone Status RAM CPU2.D0" begin="17" end="16" width="2" rwaccess="R"/>
		<bitfield id="STATUS_RAM9" description="Zone Status RAM CPU2.D1" begin="19" end="18" width="2" rwaccess="R"/>
	</register>
	<register id="SECERRSTAT" width="32" page="1" offset="0x30" internal="0" description="Security Error Status Register">
		<bitfield id="ERR" description="Security Configuration load Error Status" begin="0" end="0" width="1" rwaccess="R"/>
	</register>
	<register id="SECERRCLR" width="32" page="1" offset="0x34" internal="0" description="Security Error Clear Register">
		<bitfield id="ERR" description="Clear Security Configuration Load Error Status Bit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="SECERRFRC" width="32" page="1" offset="0x38" internal="0" description="Security Error Force Register">
		<bitfield id="ERR" description="Set Security Configuration Load Error Status Bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="Valid Register Write Key" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
</module>
